---
type: ColorFillSchemeEntry
namespace: Autodesk.Revit.DB
version: 2024
members: 18
tags: [revit-api, class]
---

# ColorFillSchemeEntry

`Autodesk.Revit.DB.ColorFillSchemeEntry` · Revit 2024 · 18 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ColorFillSchemeEntry | 2022 | `public ColorFillSchemeEntry ( StorageType storageType )` |
| Method | CanSetValue | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDoubleValue | 2022 | `public double GetDoubleValue ()` |
| Method | GetElementIdValue | 2022 | `public ElementId GetElementIdValue ()` |
| Method | GetIntegerValue | 2022 | `public int GetIntegerValue ()` |
| Method | GetStringValue | 2022 | `public string GetStringValue ()` |
| Method | SetDoubleValue | 2022 | `public void SetDoubleValue ( double value )` |
| Method | SetElementIdValue | 2022 | `public void SetElementIdValue ( ElementId value )` |
| Method | SetIntegerValue | 2022 | `public void SetIntegerValue ( int value )` |
| Method | SetStringValue | 2022 | `public void SetStringValue ( string value )` |
| Property | Caption | 2022 | `public string Caption { get ; set ; }` |
| Property | Color | 2022 | `public Color Color { get ; set ; }` |
| Property | FillPatternId | 2022 | `public ElementId FillPatternId { get ; set ; }` |
| Property | IsInUse | 2022 | `public bool IsInUse { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | IsVisible | 2022 | `public bool IsVisible { get ; set ; }` |
| Property | StorageType | 2022 | `public StorageType StorageType { get ; }` |